9/data/attachments/1ed7accb5abf6c49.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_7fed2199-367b-4fe5-92cb-d0ef27eb61e4</nif:username>
            <nif:friendToBeAdded>Sarah_price_Actions_46409_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>